////*给定程序中，函数fun 的功能是：将N×N 矩阵主对角线元素中的值与
////反向对角线对应位置上元素中的值进行交换。例如，若N=3，有下列矩阵：
////1 2 3
////4 5 6
////7 8 9
////交换后为：
////3 2 1
////4 5 6
////9 8 7*/
//
////分析
////1. 使用一个示意图来讲解, 根据示意图分析
////2. 空格1 因为调用的形式为 fun(t,N); 就可以接收一个二维数组: 填写 t[][N]
////3. 空格3 for(___2___; i++) 完成一个交换任务: 填写 s
////4. 空格4 是用于控制循环的次数 填写 i = 0; i < n
////5. 测试
//
//#include < stdio.h >
//#define N 4
//void fun(int t[][N] , int n)
//{ int i,s;
//for(i = 0; i < n ; i++)
//{ s=t[i][i]; // t[i][i] 就是第i行 主对角线的元素, 或者 反对角线的元素
//t[i][i]=t[i][n-i-1]; // t[i][n-i-1]; 就是第i行 反对角线的元素 或者 主对角线的元素
//t[i][n-1-i]=s;
//}
//}
//main()
//{ int t[][N]={21,12,13,24,25,16,47,38,29,11,32,54,42,21,33,10}, i, j;
//printf("\nThe original array:\n");
//for(i=0; i< N; i++)
//{ for(j=0; j< N; j++) printf("%d ",t[i][j]);
//printf("\n");
//}
//fun(t,N);
//printf("\nThe result is:\n");
//for(i=0; i< N; i++)
//{ for(j=0; j< N; j++) printf("%d ",t[i][j]);
//printf("\n");
//}
//getchar();
//}