///*给定程序的功能是根据形参m（2≤m≤9），在二维数组中存放一张m
//行m 列的表格，由main()函数输出。
//例如，若输入2 则输出： 
//1 2 
//2 4  
//若输入4， 则输出：
//1 2 3 4
//2 4 6 8
//3 6 9 12
//4 8 12 16*/
//
////分析
////1. 空格2 调用fun函数时，传入实参, 填写 a, n // a 是全局二维数组
//// 2. 空格1 ， 因为 fun 函数的功能就是对 a 数组进行赋值操作, 注意 a 数组的  10 * 10 
////     但是再赋值时， 是 m * m , 填写  a[j][k]  ，j 是行 k是列
//// 3. 空格3 
///*
//	for ( i = 0 ; i < n ; i++)
//{ for (j = 0 ; j < n ; j++)
//printf ( "%4d", ___3___ ) ;
//printf ( "\n" ) ;
//}
//是输出a 数组的 n 行 n 列
//
//填写 a[i][j]
//
//*/
//#include < stdio.h >
//#define M 10
//int a[M][M] = {0} ;
//void fun(int a[][M], int m)
//{ int j, k ;
//for (j = 0 ; j < m ; j++ )
//for (k = 0 ; k < m ; k++ )
//a[j][k] = (k+1)*(j+1);
//}
//main ( )
//{ int i, j, n ;
//printf ( " Enter n : " ) ; scanf ("%d", &n ) ;
//fun ( a, n ) ; 
//for ( i = 0 ; i < n ; i++)
//{ for (j = 0 ; j < n ; j++)
//printf ( "%4d", a[i][j] ) ;
//printf ( "\n" ) ;
//}
//}