//#include <stdio.h>
//void main() {
//	
//	//处理的流程 10 / 4 = 2.5  ==截取整数==> 2 => 2.00000
//	double d1 = 10 / 4; // 
//	double d2 = 10.0 / 4; //如果希望保留小数，参与运算数必须有浮点数
//	
//	//给大家一个取模的公式
//	// a % b =  a - a / b * b
//
//	int res1 = 10 % 3; // 求10/3 的余数 1
//	int res2 = -10 % 3; // = -10 - (-10) / 3 * 3 = -10- (-3) * 3 = -10 + 9 = -1
//	int res3 = 10 % -3; // 10 - 10 / (-3) * (-3) =  10 - 9 = 1
//	int res4 = -10 % -3; // ? -1
//	
//	//++ 的使用
//
//	int i = 10;
//	int j = i++; // 运算规则等价是 int j = i; i = i + 1; ==> j = 10, i=11
//	int k = ++i; // 运算规则等价  i = i + 1; int k = i; ===> i=12, k =12
//
//	printf("\n i=%d j=%d", i, j); //i=12   j=10
//	printf("\n i=%d k=%d", i ,k );// i = 12 k = 12
//	printf("\nd1=%f d2=%f res1=%d res2=%d res3=%d res4=%d", d1, d2, res1, res2, res3, res4); //
//	
//	//++ 或者 -- 还可以独立使用, 就相当于自增
//	//k++ 等价于  k = k +1
//	//++k 等价于 k= k +1
//	//如果独立使用  ++k 和 k++ 完全等价
//	k++; // k = 13
//	++k;// k = 14
//	printf("\nk=%d", k); //k = 14
//
//	getchar();
//
//}