//#include <stdio.h>
//
//void main() {
//
////	*************************************
////	    小小计算器
////*************************************
////10 + 5 =15
////10 - 5 = 5
////10 * 5 = 50
////10 / 5 = 2
//
//	//分析
//	//1. 定义两个 int
//	//2. 根据要求进行计算，得到不同结果，可以再定义变量
//
//	int n1 = 10;
//	int n2 = 5;
//	int sum = n1 + n2;
//	int sub = n1 - n2;
//	int mul = n1 * n2;
//	int div = n1 / n2;
//	int mod = n1 % n2;
//	int num = 11;
//
//	//输出
//	printf("\n*************************************");
//	printf("\n        小小计算器");
//	printf("\n*************************************");
//
//	printf("\n %d + %d = %d", n1, n2, sum);
//	printf("\n %d - %d = %d", n1, n2, sub);
//	printf("\n %d * %d = %d", n1, n2, mul);
//	printf("\n %d / %d = %d", n1, n2, div);
//	printf("\n %d 模 %d = %d", n1, n2, mod);
//
//
//	//判断num 是不是偶数还是基数
//	//if-else 后面要学习的分支结构，后面会详解讲解
//	if(num % 2 == 0) { //偶数
//		printf("\n%d 是偶数", num);
//	} else {
//		printf("\n%d 是奇数", num);
//	}
//
//	getchar();
//}